<a href="https://colab.research.google.com/github/feliperromao/datascience-na-pratica/blob/main/ds_na_pratica___introducao_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [33]:
import pandas as pd

### Importando um dataframe a partir de um arquivo CSV

In [34]:
df = pd.read_csv("https://raw.githubusercontent.com/carlosfab/curso_data_science_na_pratica/master/modulo_02/BBAS3.SA.csv")

In [35]:
df

           Date       Open       High  ...      Close  Adj Close    Volume
0    2018-09-21  29.730000  30.580000  ...  30.580000  28.680056  16301600
1    2018-09-24  30.379999  30.700001  ...  29.730000  27.882866  13086900
2    2018-09-25  29.030001  29.760000  ...  29.549999  27.714045  11742900
3    2018-09-26  29.650000  29.969999  ...  29.450001  27.620264  12842400
4    2018-09-27  29.680000  30.299999  ...  30.290001  28.408072   8767900
..          ...        ...        ...  ...        ...        ...       ...
241  2019-09-16  47.040001  47.560001  ...  46.650002  46.650002   8175500
242  2019-09-17  46.389999  47.450001  ...  47.299999  47.299999   6744200
243  2019-09-18  47.459999  48.250000  ...  48.020000  48.020000   8528300
244  2019-09-19  48.410000  48.700001  ...  46.770000  46.770000   9661800
245  2019-09-20  47.000000  47.980000  ...  47.509998  47.509998  15284500

[246 rows x 7 columns]

### Visualizando quantidade de registros e colunas no data frame

In [36]:
df.shape

(246, 7)

### Visualizando os tipos das colunas

In [37]:
df.dtypes

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
dtype: object

### Visualizando os primeiros 5 registros

In [38]:
df.head()

         Date       Open       High        Low      Close  Adj Close    Volume
0  2018-09-21  29.730000  30.580000  29.340000  30.580000  28.680056  16301600
1  2018-09-24  30.379999  30.700001  29.500000  29.730000  27.882866  13086900
2  2018-09-25  29.030001  29.760000  28.809999  29.549999  27.714045  11742900
3  2018-09-26  29.650000  29.969999  29.209999  29.450001  27.620264  12842400
4  2018-09-27  29.680000  30.299999  29.680000  30.290001  28.408072   8767900

### Visualizando os ultimos 5 registros

In [39]:
df.tail()

           Date       Open       High  ...      Close  Adj Close    Volume
241  2019-09-16  47.040001  47.560001  ...  46.650002  46.650002   8175500
242  2019-09-17  46.389999  47.450001  ...  47.299999  47.299999   6744200
243  2019-09-18  47.459999  48.250000  ...  48.020000  48.020000   8528300
244  2019-09-19  48.410000  48.700001  ...  46.770000  46.770000   9661800
245  2019-09-20  47.000000  47.980000  ...  47.509998  47.509998  15284500

[5 rows x 7 columns]

### Listando os nomes das colunas

In [40]:
df.columns

Index(['Date', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume'], dtype='object')

In [41]:
for column in df.columns:
  print("Nome da coluna\t{}".format(column))

Nome da coluna	Date
Nome da coluna	Open
Nome da coluna	High
Nome da coluna	Low
Nome da coluna	Close
Nome da coluna	Adj Close
Nome da coluna	Volume

### Ver os 5 primeiros registros da coluna `High`

In [42]:
df["High"].head()

0    30.580000
1    30.700001
2    29.760000
3    29.969999
4    30.299999
Name: High, dtype: float64

### Calculando a média da coluna `High`

In [43]:
df["High"].mean()

48.15211368292682

## Criando Data frame

In [44]:
dados = {
    "nome": ['Felipe', 'José', 'Romão', 'Martins'],
    "idade": [21, 28, 23, 20],
    "cidade": ["Fortaleza", "Caucaia", "Maranguape", "Eusébio"],
    "comprou": [True, False, True, True]
}

new_df = pd.DataFrame(dados)
display(new_df)

      nome  idade      cidade  comprou
0   Felipe     21   Fortaleza     True
1     José     28     Caucaia    False
2    Romão     23  Maranguape     True
3  Martins     20     Eusébio     True

### Data frame a partir de listas

In [45]:
nomes = ['Felipe 2', 'José 1', 'Romão 3', 'Martins 4']
idades = [21, 28, 23, 20]
cidades = ["Fortaleza", "Caucaia", "Maranguape", "Eusébio"]
compras = [True, False, True, True]

labels = ['nome', 'idade', 'cidade', 'comprou']
list_cols = [nomes, idades, cidades, compras]

dados = dict(list(zip(labels, list_cols)))

new_df = pd.DataFrame(dados)
new_df

        nome  idade      cidade  comprou
0   Felipe 2     21   Fortaleza     True
1     José 1     28     Caucaia    False
2    Romão 3     23  Maranguape     True
3  Martins 4     20     Eusébio     True

### Criar novas colunas

In [46]:
new_df["status"] = True
new_df["saldo"] = [0.0, 1.2, 1.4, 1.9]
new_df

        nome  idade      cidade  comprou  status  saldo
0   Felipe 2     21   Fortaleza     True    True    0.0
1     José 1     28     Caucaia    False    True    1.2
2    Romão 3     23  Maranguape     True    True    1.4
3  Martins 4     20     Eusébio     True    True    1.9

### Atualizando o indice

In [48]:
new_df.index

RangeIndex(start=0, stop=4, step=1)

In [49]:
new_df.index = ['a', 'b', 'c', 'd']
new_df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

### Alterando nome das colunas

In [51]:
new_df.columns = ["Nome do Cliente", "Idade", "Naturalidade", "Fez compras", "Cadastro ativo", "Salvo em loja"]
new_df

  Nome do Cliente  Idade  ... Cadastro ativo  Salvo em loja
a        Felipe 2     21  ...           True            0.0
b          José 1     28  ...           True            1.2
c         Romão 3     23  ...           True            1.4
d       Martins 4     20  ...           True            1.9

[4 rows x 6 columns]